tutorials/single_phase_elastic/Aug29_High_conc/pillarsSolidsElastic/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          720;
        startFace       181547;
    }
    inlet
    {
        type            patch;
        nFaces          253;
        startFace       182267;
    }
    outlet
    {
        type            patch;
        nFaces          253;
        startFace       182520;
    }
    emptyFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          182160;
        startFace       182773;
    }
)

// ************************************************************************* //
